[
  {
    "title": "Doa Sapu Jagat",
    "arabic": "رَبَّنَا آَتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآَخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "latin": "Rabbanā ātinā fīddunyā ḥasanah wa fīlākhirati ḥasanah waqinā 'ażābannār",
    "translation": "Ya Allah, berikanlah kepada kami kebaikan di dunia, berikan pula kebaikan di akhirat dan lindungilah kami dari siksa neraka.",
    "notes": null,
    "fawaid": "Doa ini adalah doa yang paling sering dipanjatkan oleh Nabi Shallallahu 'alaihi wa sallam, sebagaimana penuturan sahabat Anas bin Malik radhiyallahu 'anhu.",
    "source": "QS. Al-Baqarah: 201, al-Bukhari: 6389, HR. Muslim: 2690"
  },
  {
    "title": "Doa Memohon Ketetapan Hati #1",
    "arabic": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِى عَلَى دِينِكَ",
    "latin": "Yā muqallibal qulūb ṡabbit qalbī 'alā dīnik",
    "translation": "Wahai Dzat yang Maha membolak-balikkan hati, teguhkanlah hatiku di atas agama-Mu.",
    "notes": null,
    "fawaid": "Hati seseorang berada diantara jemari-jemari Allah ta'ala, dan Dia membolak-balikkan sesuai dengan kehendak-Nya. Maka, sudah selayaknya seseorang untuk senantiasa memohon agar Allah tetapkan hatinya di atas kebaikan, dan senantiasa istiqamah dalam kebenaran.",
    "source": "HR. at-Tirmidzi, No. 3522 dan Ahmad, 6: 315"
  },
  {
    "title": "Doa Memohon Ketetapan Hati #2",
    "arabic": "اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ",
    "latin": "Allāhumma muṣarrifal qulūb ṣarrif qulūbanā 'alā ṭā'ātika",
    "translation": "Ya Allah, Dzat yang memalingkan hati, palingkanlah hati kami kepada ketaatan beribadah kepada-Mu.",
    "notes": null,
    "fawaid": "Hati seseorang berada diantara jemari-jemari Allah ta'ala, dan Dia membolak-balikkan sesuai dengan kehendak-Nya. Maka, sudah selayaknya seseorang untuk senantiasa memohon agar Allah tetapkan hatinya di atas kebaikan, dan senantiasa istiqamah dalam kebenaran.",
    "source": "HR. Muslim No. 2654"
  },
  {
    "title": "Doa Memohon Ketetapan Hati #3",
    "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا",
    "latin": "Rabbanā lā tuzigh qulūbanā ba'da iż hadaytanā",
    "translation": "Ya Tuhan kami, janganlah Engkau jadikan hati kami condong kepada kesesatan sesudah Engkau beri petunjuk kepada kami.",
    "notes": null,
    "fawaid": "Hati seseorang berada diantara jemari-jemari Allah ta'ala, dan Dia membolak-balikkan sesuai dengan kehendak-Nya. Maka, sudah selayaknya seseorang untuk senantiasa memohon agar Allah tetapkan hatinya di atas kebaikan, dan senantiasa istiqamah dalam kebenaran.",
    "source": "QS. Ali Imran: 8"
  },
  {
    "title": "Doa Berlindung dari Hilangnya Kenikmatan",
    "arabic": "اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ",
    "latin": "Allāhumma innī a'ūżu bika min zawāli ni'matika, wa taḥawwuli 'āfiyatika, wa fujā'ati niqmatik, wa jamī'i sakhaṭik",
    "translation": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari hilangnya kenikmatan yang telah Engkau berikan, dari berubahnya kesehatan yang telah Engkau anugerahkan, dari siksa-Mu yang datang secara tiba-tiba, dan dari segala kemurkaan-Mu.",
    "notes": null,
    "fawaid": "Kenikmatan yang ada saat ini sangat mungkin hilang, sehatnya jiwa raga dalam sekejap matapun sangat bisa berubah menjadi sakit, dan hanya Allah lah yang mampu mencegah itu terjadi.",
    "source": "HR. Muslim No. 2739"
  },
  {
    "title": "Doa Tolak Bala' (Cobaan yang Berat)",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ جَهْدِ البَلاَءِ ، وَدَرَكِ الشَّقَاءِ ، وَسُوءِ القَضَاءِ ، وَشَمَاتَةِ الأَعْدَاء",
    "latin": "Allāhumma innī a'ūżu bika min jahdil balā', wa darakisy syaqā', wa sū'il qaḍā', wa syamātatil a'dā'",
    "translation": "Ya Allah, aku berlindung kepada-Mu dari bencana yang sangat berat, kesengsaraan, dan segala faktor penyebabnya, dari buruknya akibat apa yang telah ditakdirkan, serta bahagianya musuh atas musibah yang menimpa diriku.",
    "notes": null,
    "fawaid": "Berlindung dari ketentuan takdir yang berdampak buruk, tidak bertentangan dengan sikap ridha terhadap ketentuan takdir Allah azza wa jalla. Karena meminta perlindungan dari ketentuan takdir yang buruk juga merupakan ketentuan takdir Allah. Allah azza wa jalla bisa saja mentakdirkan suatu bala' kepada seseorang, namun Allah azza wa jalla juga bisa mentakdirkan bahwa bila ia berdoa, Allah akan hilangkan bala' tersebut.",
    "source": "HR. al-Bukhari: 6616, Muslim: 2707"
  },
  {
    "title": "Doa Agar Terlepas Dari Lilitan Hutang, Kegundahan, Kelemahan, Rasa Malas, Takut, dan Tekanan Orang Lain",
    "arabic": "اَللّٰهُمَّ إِنِّى أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحَزْنِ وَأَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَأَعُوْذُبِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوْذُبِكَ مِنْ غَلَبَتِ الدَّيْنِ وَقَهْرِ الرجال",
    "latin": "Allāhumma innī a'ūżu bika minal hammi wal ḥazan, wa a'ūżu bika minal 'ajzi wal kasal, wa a'ūżu bika minal jubni wal bukhl, wa a'ūżu bika min ghalabatiddayni wa qahrirrijāl",
    "translation": "Ya Allah, aku berlindung kepada-Mu dari kebingungan dan kesedihan, aku berlindung kepada-Mu dari kelemahan dan kemalasan, aku berlindung kepada-Mu dari ketakutan dan kekikiran, aku berlindung kepada-Mu dari lilitan hutang dan tekanan orang-orang.",
    "notes": null,
    "fawaid": "Sahabat yang mulia Abu Umamah yang meriwayatkan hadits ini menuturkan: setelah aku mengamalkan doa itu, Allah benar-benar menghilangkan kebingunganku dan memberikanku kemampuan melunasi hutang.",
    "source": "HR. Abu Dawud No. 1555"
  },
  {
    "title": "Doa Ketika Mendapatkan Sesuatu yang Menyenangkan",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِى بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
    "latin": "Alhamdulillāhillażī bini'matihī tatimmuṣṣāliḥāt",
    "translation": "Segala puji bagi Allah, dimana dengan nikmatnya kebaikan menjadi sempurna.",
    "notes": null,
    "fawaid": "Aisyah radhiyallahu 'anha mengatakan, Rasulullah shallallahu 'alaihi wa sallam apabila melihat sesuatu yang beliau sukai, beliau membaca kalimat di atas.",
    "source": "HR. Ibnu Majah dalam Sunannya, No. 3803 dan al-Hakim dalam al-Mustadrak (1/499)"
  },
  {
    "title": "Doa Ayat 5",
    "arabic": "لَمْ تَرَ إِلَى ٱلْمَلَإِ مِنۢ بَنِيٓ إِسْرَٰٓءِيلَ مِنۢ بَعْدِ مُوسَىٰٓ إِذْ قَالُوا۟ لِنَبِيّٖ لَّهُمُ ٱبْعَثْ لَنَا مَلِكٗا نُّقَٰتِلْ فِي سَبِيلِ ٱللَّهِ ۖ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ أَلَّا تُقَٰتِلُوا۟ ۝ قَالُوا۟ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدْ أُخْرِجْنَا مِن دِيَٰرِنَا وَأَبْنَآئِنَا ۖ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ تَوَلَّوْا۟ إِلَّا قَلِيلٗا مِّنْهُمْ ۗ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ ۝ لَّقَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّذِينَ قَالُوٓا۟ إِنَّ ٱللَّهَ فَقِيرٞ وَنَحْنُ أَغْنِيَآءُ ۘ سَنَكْتُبُ مَا قَالُوا۟ وَقَتْلَهُمُ ٱلۡأَنبِيَآءَ بِغَيْرِ حَقّٖ وَنَقُولُ ذُوقُوا۟ عَذَابَ ٱلْحَرِيقِ ۝ أَلَمْ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمْ كُفُّوٓا۟ أَيْدِيَكُمْ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ إِذَا فَرِيقٞ مِّنْهُمْ يَخْشَوْنَ ٱلنَّاسَ كَخَشْيَةِ ٱللَّهِ أَوْ أَشَدَّ خَشْيَةٗ ۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا ٱلْقِتَالَ لَوْلَآ أَخَّرْتَنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖ ۗ قُلْ مَتَٰعُ ٱلدُّنْيَا قَلِيلٞ وَٱلۡأٓخِرَةُ خَيْرٞ لِّمَنِ ٱتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلٗا ۝ وَٱتْلُ عَلَيْهِمْ نَبَأَ ٱبْنَيْ ءَادَمَ بِٱلْحَقِّ إِذْ قَرَّبَا قُرْبَانٗا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ ٱلۡآخَرِ قَالَ لَأَقْتُلَنَّكَ ۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلْمُتَّقِينَ ۝ قُلْ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرْضِ قُلِ ٱللَّهُ ۚ قُلْ أَفَٱتَّخَذْتُم مِّن دُونِهِۦٓ أَوْلِيَآءَ لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعٗا وَلَا ضَرّٗا ۚ قُلْ هَلْ يَسْتَوِي ٱلۡأَعْمَىٰ وَٱلْبَصِيرُ أَمْ هَلْ تَسْتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُ ۗ أَمْ جَعَلُوا۟ لِلَّهِ شُرَكَآءَ خَلَقُوا۟ كَخَلْقِهِۦ فَتَشَٰبَهَ ٱلۡخَلْقُ عَلَيْهِمْ ۚ قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلْوَٰحِدُ ٱلْقَهَّٰرُ ۝",
    "latin": "Lam tara ilā al-mala-i min banī isrāīla min ba'di mūsā idh qālū linabiyyin lahumub'ath lanā malikan nuqātil fī sabīlillāh, qāla hal 'asaytum in kutiba 'alaikum ul-qitālu allā tuqātilū. Qālū wamā lanā allā nuqātila fī sabīlillāh waqad ukhrijnā min diyārinā waabnāinā falammā kutiba 'alaihimul-qitālu tawallaw illā qalīlam min'hum wallāhu 'alīmun biz-zālimīn. Laqad sami'allāhu qawlal-ladhīna qālū innanallāha faqīrun wanaḥnu aghniyā', sanaktubu mā qālū waqatlahumul-anbiyā'a bighayri ḥaqqin wanaqūlu dhūqū 'adhābal-ḥarīq. Alam tara ilā alladhīna qīla lahum kuffū aydiyakum wa aqīmūṣ-ṣalāta wa ātūz-zakāh falammā kutiba 'alaihimul-qitālu idhā farīqum min'hum yakhshawna annāsa kakhashyatillāh aw ashad-da khashyah, waqālū rabbanā lima katabta 'alainal-qitāla lawlā akhkhartanā ilā ajalin qarīb, qul matā'ud-dunyā qalīl wal-ākhiratu khayrun limanittaqā walā tuẓ'lamūna fatīlā. Watlu 'alaihim naba'a ib'nay ādam bil-ḥaqqi idh qarrabā qurbānan fatuqubbila min aḥadihimā walam yutaqabbal minal-ākhar qāla la-aqtulannak, qāla innamā yataqabbalullāhu minal-muttaqīn. Qul man rabbu as-samāwāti wal-arḍ, qulillāh, qul afa-ttakhadhtum min dūnihi awliyā'a lā yamlikūna li-anfusihim naf'an walā ḍarrā, qul hal yastawī al-a'mā wal-baṣīr, am hal tastawī aẓ-ẓulumātu wannūr, am ja'alū lillāhi shurakā'a khalaqū ka-khalqihī fata shābaha al-khalqu 'alaihim, qulillāhu khāliqu kulli shay'in wahuwa al-wāḥidu al-qahhār.",
    "translation": "Belumkah kamu perhatikan pemuka-pemuka dari Bani Israil setelah (wafat) Musa, ketika mereka berkata kepada seorang nabi mereka, 'Angkatlah seorang raja untuk kami agar kami berperang di jalan Allah.' Nabi itu berkata, 'Mungkin sekali jika perang diwajibkan atasmu, kamu tidak akan berperang?' Mereka menjawab, 'Mengapa kami tidak mau berperang di jalan Allah, padahal kami telah diusir dari rumah-rumah kami dan anak-anak kami?' Tetapi ketika perang itu diwajibkan atas mereka, mereka berpaling, kecuali sebagian kecil dari mereka. Dan Allah Maha Mengetahui orang-orang yang zalim. Sungguh, Allah mendengar perkataan orang-orang yang mengatakan, 'Sesungguhnya Allah miskin dan kami kaya.' Kami akan mencatat perkataan mereka itu dan perbuatan mereka membunuh nabi-nabi tanpa alasan yang benar, dan Kami akan berkata, 'Rasakanlah azab yang membakar.' Tidakkah engkau memperhatikan orang-orang (munafik) yang dikatakan kepada mereka, 'Tahanlah tanganmu (dari berperang), laksanakanlah salat, dan tunaikanlah zakat!' Tetapi ketika mereka diwajibkan berperang, tiba-tiba sebagian dari mereka takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih takut lagi. Mereka berkata, 'Ya Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada kami sampai beberapa waktu lagi?' Katakanlah, 'Kesenangan di dunia ini hanya sebentar dan akhirat itu lebih baik untuk orang yang bertakwa, dan kamu tidak akan dizalimi sedikit pun.' Dan bacakanlah kepada mereka kisah kedua putra Adam dengan benar, ketika keduanya mempersembahkan kurban, lalu diterima dari salah seorang dari mereka berdua dan tidak diterima dari yang lain. Ia berkata, 'Aku pasti membunuhmu!' Berkata (yang lain), 'Sesungguhnya Allah hanya menerima (korban) dari orang-orang yang bertakwa.' Katakanlah, 'Siapakah Tuhan yang memiliki langit dan bumi?' Katakanlah, 'Allah.' Katakanlah, 'Mengapa kamu mengambil pelindung-pelindung selain Dia, padahal mereka tidak kuasa mendatangkan manfaat atau mudarat bagi diri mereka sendiri?' Katakanlah, 'Apakah sama orang buta dan yang dapat melihat, atau apakah sama gelap gulita dan terang benderang?' Adakah mereka menjadikan sekutu-sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya sehingga kedua ciptaan itu serupa menurut pandangan mereka? Katakanlah, 'Allah adalah Pencipta segala sesuatu dan Dialah Yang Maha Esa lagi Maha Perkasa.'",
    "notes": null,
    "fawaid": "Ayat-ayat ini menegaskan ujian keimanan Bani Israil dan kaum lainnya. Semangat dalam lisan tidak cukup jika ketika diuji malah berpaling. Pesannya: iman yang benar selalu dibuktikan dengan ketaatan meski berat. Juga teguran untuk tidak menyombongkan diri di hadapan Allah.",
    "source": "QS. Al-Baqarah: 246, Ali Imran: 181, An-Nisa: 77, Al-Maidah: 27, Al-An’am: 12"
  },
  {
    "title": "Doa Ayat 7",
    "arabic": "قُل لَّن يُصِيبَنَآ إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوْلَىٰنَا ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ ۝ وَإِن يَمْسَسْكَ ٱللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَ ۖ وَإِن يُرِدْكَ بِخَيْرٍ فَلَا رَآدَّ لِفَضْلِهِۦ ۚ يُصِيبُ بِهِۦ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۚ وَهُوَ ٱلْغَفُورُ ٱلرَّحِيمُ ۝ وَمَا مِن دَآبَّةٍ فِى ٱلْأَرْضِ إِلَّا عَلَى ٱللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۚ كُلّٞ فِى كِتَٰبٖ مُّبِينٖ ۝ إِنِّى تَوَكَّلْتُ عَلَى ٱللَّهِ رَبِّى وَرَبِّكُم ۚ مَّا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِيَتِهَآ ۚ إِنَّ رَبِّى عَلَىٰ صِرَٰطٖ مُّسْتَقِيمٖ ۝ وَكَأَيِّن مِّن دَآبَّةٖ لَّا تَحْمِلُ رِزْقَهَا ٱللَّهُ يَرْزُقُهَا وَإِيَّاكُمْ ۚ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ ۝ مَّا يَفْتَحِ ٱللَّهُ لِلنَّاسِ مِن رَّحْمَةٖ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُۥ مِنۢ بَعْدِهِۦ ۚ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ ۝ وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ لَيَقُولُنَّ ٱللَّهُ ۚ قُلْ أَفَرَءَيْتُم مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ إِنْ أَرَادَنِىَ ٱللَّهُ بِضُرٍّ هَلْ هُنَّ كَٰشِفَٰتُ ضُرِّهِۦٓ أَوْ أَرَادَنِى بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَٰتُ رَحْمَتِهِۦ ۚ قُلْ حَسْبِىَ ٱللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ ٱلْمُتَوَكِّلُونَ",
    "latin": "Qul lan yuṣībanā illā mā kataballāhu lanā, huwa maulānā, wa ‘alallāhi falyatawakkalil-mu’minūn. Wa in yamsaska Allāhu biḍurrin falā kāshifa lahu illā huwa, wa in yuridka bikhairin falā rādda li-faḍlih, yuṣību bihi man yashā’u min ‘ibādih, wa huwa al-ghafūru ar-raḥīm. Wa mā min dābbatin fil-arḍi illā ‘alallāhi rizquhā, wa ya‘lamu mustaqarrahā wa mustawda‘ahā, kullun fī kitābin mubīn. Innī tawakkaltu ‘alallāhi rabbī wa rabbikum, mā min dābbatin illā huwa ākhiḍun bināṣiyatihā, inna rabbī ‘alā ṣirāṭim mustaqīm. Wa ka-ayyin min dābbatin lā taḥmilu rizqahā, Allāhu yarzuquhā wa iyyākum, wa huwa as-samī‘ul-‘alīm. Mā yaftaḥillāhu lin-nāsi min raḥmatin falā mumsika lahā, wa mā yumsik falā mursila lahu min ba‘dih, wa huwa al-‘azīzu al-ḥakīm. Wa la-in sa’altahum man khalaqas-samāwāti wal-arḍa layaqūlunna Allāh, qul afara’aytum mā tad‘ūna min dūnillāh, in arādanī Allāhu biḍurrin hal hunna kāshifātu ḍurrih, aw arādanī biraḥmatin hal hunna mumsikātu raḥmatih, qul ḥasbiyallāh, ‘alayhi yatawakkalul-mutawakkilūn.",
    "translation": "Katakanlah: 'Sekali-kali tidak akan menimpa kami melainkan apa yang telah ditetapkan Allah untuk kami. Dialah Pelindung kami, dan hanya kepada Allah orang-orang mukmin harus bertawakal.' Jika Allah menimpakan suatu kemudharatan kepadamu, maka tidak ada yang dapat menghilangkannya selain Dia. Dan jika Allah menghendaki kebaikan bagimu, maka tidak ada yang dapat menolak karunia-Nya. Dia memberikan kebaikan itu kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya. Dan Dialah Yang Maha Pengampun lagi Maha Penyayang. Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya, dan Dia mengetahui tempat kediamannya dan tempat penyimpanannya. Semuanya tertulis dalam Kitab yang nyata. Sesungguhnya aku bertawakal kepada Allah, Tuhanku dan Tuhanmu. Tidak ada suatu binatang melata pun melainkan Dialah yang memegang ubun-ubunnya. Sesungguhnya Tuhanku berada di jalan yang lurus. Dan berapa banyak makhluk yang tidak dapat membawa rezekinya sendiri, Allah-lah yang memberi rezeki kepadanya dan kepadamu, dan Dia Maha Mendengar lagi Maha Mengetahui. Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorang pun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorang pun yang sanggup melepaskannya sesudah itu. Dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana. Dan sungguh, jika kamu tanyakan kepada mereka: 'Siapakah yang menciptakan langit dan bumi?' pasti mereka menjawab: 'Allah'. Katakanlah: 'Maka terangkanlah kepadaku tentang apa yang kamu seru selain Allah, jika Allah hendak mendatangkan kemudharatan kepadaku, apakah mereka dapat menghapuskan kemudharatan itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat menahan rahmat-Nya?' Katakanlah: 'Cukuplah Allah bagiku. Hanya kepada-Nya orang-orang yang bertawakal berserah diri.'",
    "notes": null,
    "fawaid": "Ayat-ayat ini mengajarkan keyakinan penuh pada ketetapan Allah, pentingnya tawakal, dan jaminan Allah atas rezeki seluruh makhluk. Sekaligus menegaskan bahwa tidak ada penolong selain Allah.",
    "source": "QS. At-Taubah: 51 • QS. Yunus: 107 • QS. Hud: 6 • QS. Hud: 56 • QS. Al-‘Ankabut: 60 • QS. Fathir: 2 • QS. Az-Zumar: 38"
  },
  {
    "title": "Doa Ayat 15",
    "arabic": "الٓمٓ ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ − شَهِدَ ٱللَّهُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا هُوَ وَٱلْمَلَٰٓئِكَةُ وَأُو۟لُوا۟ ٱلْعِلْمِ قَآئِمًۢا بِٱلْقِسْطِ ۚ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ − إِنَّ ٱللَّهَ فَالِقُ ٱلْحَبِّ وَٱلنَّوَىٰ ۖ يُخْرِجُ ٱلْحَىَّ مِنَ ٱلْمَيِّتِ وَمُخْرِجُ ٱلْمَيِّتِ مِنَ ٱلْحَىِّ ۚ ذَٰلِكُمُ ٱللَّهُ ۖ فَأَنَّىٰ تُؤْفَكُونَ − وَلَوْ أَنَّ قُرْءَانًا سُيِّرَتْ بِهِ ٱلْجِبَالُ أَوْ قُطِّعَتْ بِهِ ٱلْأَرْضُ أَوْ كُلِّمَ بِهِ ٱلْمَوْتَىٰ ۗ بَل لِّلَّهِ ٱلْأَمْرُ جَمِيعًا ۗ أَفَلَمْ يَا۟يْـَٔسِ ٱلَّذِينَ ءَامَنُوٓا۟ أَن لَّوْ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعًا ۗ وَلَا يَزَالُ ٱلَّذِينَ كَفَرُوا۟ تُصِيبُهُم بِمَا صَنَعُوا۟ قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِّن دَارِهِمْ حَتَّىٰ يَأْتِىَ وَعْدُ ٱللَّهِ ۚ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادَ − إِنَّمَآ أَمْرُهُۥٓ إِذَآ أَرَادَ شَيْـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ − ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَٰلَمِينَ − أَفَعَيِينَا بِٱلْخَلْقِ ٱلْأَوَّلِ ۚ بَلْ هُمْ فِى لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ − هُوَ ٱلَّذِى خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ فِى سِتَّةِ أَيَّامٍ ثُمَّ ٱسْتَوَىٰ عَلَى ٱلْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِى ٱلْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ − لَقَدْ أَرْسَلْنَا رُسُلَنَا بِٱلْبَيِّنَٰتِ وَأَنزَلْنَا مَعَهُمُ ٱلْكِتَٰبَ وَٱلْمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلْقِسْطِ ۖ وَأَنزَلْنَا ٱلْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعْلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلْغَيْبِ ۚ إِنَّ ٱللَّهَ قَوِىٌّ عَزِيزٌ − ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ − وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍ قَدْرًا − لِّيَعْلَمَ أَن قَدْ أَبْلَغُوا۟ رِسَٰلَٰتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَىْءٍ عَدَدًۢا − رَّبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ لَآ إِلَٰهَ إِلَّا هُوَ فَٱتَّخِذْهُ وَكِيلًا − يَوْمَ يَقُومُ ٱلرُّوحُ وَٱلْمَلَٰٓئِكَةُ صَفًّا ۖ لَّا يَتَكَلَّمُونَ إِلَّا مَنْ أَذِنَ لَهُ ٱلرَّحْمَٰنُ وَقَالَ صَوَابًا − مِنْ أَىِّ شَىْءٍ خَلَقَهُۥ − مِن نُّطْفَةٍ خَلَقَهُۥ فَقَدَّرَهُۥ − ذِى قُوَّةٍ عِندَ ذِى الْعَرْشِ مَكِينٍ − وَٱللَّهُ مِن وَرَآئِهِم مُّحِيطٌۢ − بَلْ هُوَ قُرْءَانٌ مَّجِيدٌ − فِى لَوْحٍ مَّحْفُوظٍۭ",
    "latin": "Alif-Lām-Mīm ـ Allāhu lā ilāha illā huwa al-Ḥayyu al-Qayyūm ـ Shahida Allāhu annahu lā ilāha illā huwa wa al-malāʾikatu wa ūlū al-ʿilmi qāʾiman bil-qisṭi ـ Lā ilāha illā huwa al-ʿAzīzu al-Ḥakīm ـ Inna Allāha fāliqu al-ḥabbi wa an-nawā ـ Yukhriju al-ḥayya mina al-mayyiti wa mukhriju al-mayyiti mina al-ḥayyi ـ Dhālikumu Allāh ـ Fa-annā tuʾfakūn ـ Walaw anna qurʾānan suy-yirat bihi al-jibālu aw quṭṭiʿat bihi al-arḍu aw kullima bihi al-mawtā ـ Bal lillāhi al-amru jamīʿan ـ Aflam yā-yaʾisu alladhīna āmanū an law yashāʾ Allāhu lahadā an-nāsa jamīʿan ـ Walā yazālu alladhīna kafarū tuṣībuhum bimā ṣanaʿū qāriʿatun aw taḥullu qarīban min dārihim ḥattā yātiya waʿdu Allāh ـ Inna Allāha lā yukhlifu al-mīʿād ـ Innamā amruhu idhā arāda shayʾan an yaqūla lahu kun fayakūn ـ Al-ḥamdu lillāhi rabbi al-ʿālamīn ـ Afayainā bil-khalqi al-awwali ـ Bal hum fī labsin min khalqin jadīd ـ Huwa alladhī khalaqa as-samāwāti wa al-arḍa fī sittati ayyāmin thumma istawā ʿalā al-ʿarshi ـ Yaʿlamu mā yaliju fī al-arḍi wa mā yakhruju minhā wa mā yanzilu mina as-samāʾi wa mā yaʿruju fīhā ـ Wa huwa maʿakum ayna ma kuntum ـ Wallāhu bimā taʿmalūna baṣīr ـ Laqad arsalnā rusulana bil-bayyināti wa anzalnā maʿahumu al-kitāba wa al-mīzāna liyaqūma an-nāsu bil-qisṭi ـ Wa anzalnā al-ḥadīda fīhi baʾsun shadīdun wa manāfiʿu lin-nāsi waliyaʿlama Allāhu man yanṣuruhu wa rusulahu bil-ghaybi ـ Inna Allāha qawiyyun ʿazīz ـ Allāhu lā ilāha illā huwa ـ Wa ʿalā Allāhi falyatawakkal al-muʾminūn ـ Wa yarzuquhu min ḥaythu lā yaḥtasibu ـ Wa man yatawakkal ʿalā Allāhi fahuwa ḥasbuhu ـ Inna Allāha bālaghu amrihi ـ Qad jaʿala Allāhu likulli shayʾin qadran ـ Liyaʿlama anna qad ablaghū rusulāti rabbihim wa aḥāṭa bimā ladayhim wa aḥṣā kulla shayʾin ʿaddan ـ Rabbu al-mashriqi wa al-maghrib lā ilāha illā huwa fat-takhidh-hu wakīlan ـ Yawma yaqūmu ar-rūḥu wa al-malāʾikatu ṣaffan ـ Lā yatakallamūna illā man adhina lahu ar-Raḥmānu wa qāla ṣawāban ـ Min ayy shayʾin khalaqahu ـ Min nuṭfatin khalaqahu faqaddarahu ـ Dhī quwwatin ʿinda dhī al-ʿarshi makīn ـ Wallāhu min warāʾihim muḥīṭ ـ Bal huwa qurʾānun majīd ـ Fī laḥfin maḥfūẓ",
    "translation": "Artinya: 'Alif-Lām-Mīm. Allah, tidak ada tuhan selain Dia, Yang Maha Hidup, Maha Menjaga. Allah menyaksikan bahwa tidak ada tuhan selain Dia, begitu juga para malaikat dan orang-orang yang berilmu, tetap dalam keadilan. Allah, Yang Maha Perkasa, Maha Bijaksana. Sesungguhnya Allah Memisahkan biji dan tanaman, mengeluarkan yang hidup dari yang mati dan yang mati dari yang hidup. Itulah Allah. Maka bagaimana kalian bisa disesatkan? Jika Al-Qur'an ini digerakkan oleh gunung, atau dipotong bumi, atau dibicarakan oleh orang mati, semuanya milik Allah. Tidakkah orang-orang yang beriman merasa putus asa? Jika Allah menghendaki, Dia akan memberi petunjuk kepada semua manusia. Dan orang-orang kafir akan terus ditimpa akibat perbuatan mereka, hingga datang janji Allah. Sesungguhnya Allah tidak mengingkari janji. Perintah-Nya jika Dia menghendaki sesuatu, cukup berkata 'Jadilah', maka jadilah. Segala puji bagi Allah, Rabb seluruh alam. Apakah kita merasa puas dengan ciptaan pertama? Bahkan mereka dalam kebingungan dari ciptaan baru. Dialah yang menciptakan langit dan bumi dalam enam hari, kemudian Dia bersemayam di atas Arsy. Dia mengetahui apa yang masuk ke bumi dan apa yang keluar darinya, apa yang turun dari langit dan apa yang naik ke sana. Dia bersama kalian di mana saja kalian berada, dan Allah Maha Melihat apa yang kalian kerjakan. Kami telah mengutus rasul-rasul dengan bukti-bukti, menurunkan Kitab dan Timbangan agar manusia tegak dalam keadilan. Kami menurunkan besi yang memiliki kekuatan dan manfaat untuk manusia, agar Allah mengetahui siapa yang menolong-Nya dan rasul-Nya secara ghaib. Sesungguhnya Allah Maha Kuat, Maha Perkasa. Allah, tidak ada tuhan selain Dia. Dan hanya kepada Allah orang-orang beriman bertawakkal. Dia memberi rezeki dari arah yang tidak disangka-sangka. Barangsiapa bertawakkal kepada Allah, Dia cukup baginya. Sesungguhnya Allah mewujudkan urusan-Nya, Dia telah menetapkan ukuran untuk segala sesuatu. Agar diketahui bahwa mereka telah menyampaikan risalah Rabb mereka, mengetahui apa yang ada pada mereka, dan menghitung segala sesuatu dengan pasti. Rabb Timur dan Barat, tidak ada tuhan selain Dia, maka jadikan Dia pelindung. Pada hari ketika ruh dan para malaikat berdiri berbaris, mereka tidak berbicara kecuali yang diizinkan oleh Ar-Rahman, dan berkata dengan benar. Dari apa pun Dia menciptakannya. Dari setetes mani Dia menciptakannya, kemudian Dia menentukan takdirnya. Yang memiliki kekuatan di sisi Arsy yang kokoh. Dan Allah mengelilingi mereka. Sungguh, ini adalah Al-Qur'an yang mulia, dalam Lauh yang terjaga.'",
    "notes": null,
    "fawaid": "Ayat-ayat ini menekankan kekuasaan Allah, penciptaan, rezeki, takdir, dan pentingnya tawakkal serta iman kepada Allah.",
    "source": "Al-Baqarah 2:255, Al-An‘am 6:73–79, Yasin 36:81–82, Al-Fatihah 1:1–7, Al-Mulk 67:15, Al-Hadid 57:25, Al-Jinn 72:28, Qaf 50:16–18"
  },
  {
    "title": "Ayat Kursi",
    "arabic": "اَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَۚ اَلْحَيُّ الْقَيُّوْمُ ەۚ لَا تَأْخُذُهٗ سِنَةٌ وَّلَا نَوْمٌۗ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖۗ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرْسِيُّهُ السَّمٰوٰتِ وَالْاَرْضَۚ وَلَا يَـُٔوْدُهٗ حِفْظُهُمَاۚ وَهُوَ الْعَلِيُّ الْعَظِيْمُ (٢٥٥)",
    "latin": "Allāhu lā ilāha illā huwa al-Ḥayyu al-Qayyūm, lā ta’khudhuhu sinatuw wa lā nawm, lahu mā fis-samāwāti wa mā fil-arḍ, man dhalladhī yashfa'u 'indahu illā bi-idhnihi, ya'lamu mā baina aydīhim wa mā khalfahum, wa lā yuḥīṭūna bi shay'in min 'ilmihi illā bimā shā', wasi'a kursiyyu-hus-samāwāti wal-arḍ, wa lā ya'ūdhu hifẓuhumā, wa huwa al-'Aliyyul-'Aẓīm",
    "translation": "Allah, tidak ada Tuhan selain Dia, Yang Maha Hidup, Maha Menjaga. Tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Siapa yang dapat memberi syafaat di sisi-Nya tanpa izin-Nya? Dia mengetahui apa yang di depan mereka dan apa yang di belakang mereka, dan mereka tidak mengetahui apa pun dari ilmu-Nya kecuali apa yang Dia kehendaki. Kursi-Nya meliputi langit dan bumi, dan Dia tidak merasa berat memelihara keduanya. Dia Maha Tinggi, Maha Agung.",
    "notes": "Ayat Kursi adalah ayat ke-255 dari Surah Al-Baqarah, sering dibaca untuk perlindungan dan keberkahan.",
    "fawaid": "Membaca Ayat Kursi memberikan perlindungan dari kejahatan, meningkatkan iman, dan menjadi pengingat kekuasaan Allah.",
    "source": "Al-Baqarah 2:255"
  },
  {
    "title": "Doa Nifas Syaban",
    "arabic": "اَللّٰهُمَّ يَا ذَا الْمَنِّ وَلَا يُمَنُّ عَلَيْكَ يَا ذَا الْجَلَالِ وَالإِكْرَامِ يَا ذَا الطَوْلِ وَالإِنْعَامِ لَا إِلٰهَ إِلَّا أَنْتَ ظَهْرَ اللَّاجِيْنَ وَجَارَ المُسْتَجِيْرِيْنَ وَمَأْمَنَ الخَائِفِيْنَ اللّٰهُمَّ إِنْ كُنْتَ كَتَبْتَنِيْ عِنْدَكَ فِيْ أُمِّ الكِتَابِ شَقِيًّا أَوْ مَحْرُومًا أَوْ مُقْتَرًّا عَلَيَّ فِي الرِزْقِ فَامْحُ اللّٰهُمَّ فِي أُمِّ الكِتَابِ شَقَاوَتِي وَحِرْمَانِي وَاقْتِتَارَ رِزْقِيْ وَاكْتُبْنِيْ عِنْدَكَ سَعِيْدًا مَرْزُوْقًا مُوَفَّقًا لِلْخَيْرَاتِ فَإِنَّكَ قُلْتَ وَقَوْلُكَ الْحَقُّ فِيْ كِتَابِكَ المُنْزَلِ عَلَى لِسَانِ نَبِيِّكَ المُرْسَلِ 'يَمْحُو اللهُ مَا يَشَاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الكِتَابِ' وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى اٰلِهِ وَصَحْبِهِ وَسَلَّمَ وَالْحَمْدُ لِلّٰهِ رَبِّ العَالَمِينَ",
    "latin": "Allāhumma yā dhal-manni wa lā yumannu ʿalayka, yā dhal-jalāli wal-ikram, yā dhat-tawli wal-inʿām, lā ilāha illā anta ẓahra al-lājīn wa jāra al-mustajīrīn wa maʾmana al-khāʾifīn, Allāhumma in kunta katabtani ʿindaka fī Ummil Kitāb shaqiyyan aw maḥrūman aw muqtaran ʿalayya fī ar-rizqi, famḥu Allāhumma fī Ummil Kitāb shaqāwatī wa ḥirmānī wa iqtitār rizqī, waktubnī ʿindaka saʿīdan marzūqan muwaffaqan lil-khairāt, fa-innaka qulta wa qawluka al-ḥaq fī kitābika al-munzal ʿalā lisāni nabiyyika al-mursal 'yamḥu Allāhu mā yashāʾu wa yuthbitu wa ʿindahu Ummul Kitāb', wa ṣallā Allāhu ʿalā sayyidinā Muḥammad wa ʿalā ālihi wa ṣaḥbihi wa sallam, wal-ḥamdu lillāhi rabbil-ʿālamīn",
    "translation": "Ya Allah, wahai Dzat yang Maha Pemberi karunia dan tiada seorang pun dapat memberi selain-Mu, wahai Dzat Yang Maha Mulia dan Pemurah, Yang Maha Tinggi dan Pemberi Nikmat, tiada tuhan selain Engkau, Penopang bagi para yang membutuhkan, Perlindungan bagi yang memohon pertolongan, dan tempat aman bagi orang-orang yang takut. Ya Allah, jika Engkau telah menulisku di sisi-Mu dalam Ummul Kitab sebagai orang celaka, terhalang, atau sempit rezekinya, hapuskanlah kesialanku, kekurangan, dan sempitnya rezekiku, dan tuliskanlah aku di sisi-Mu sebagai orang bahagia, diberikan rezeki, dan dimudahkan dalam kebaikan. Sesungguhnya Engkau berfirman dengan benar dalam Kitab-Mu yang diturunkan melalui lisan Nabi-Mu: 'Allah menghapus apa yang Dia kehendaki dan menetapkan apa yang Dia kehendaki, dan di sisi-Nya ada Ummul Kitab.' Semoga shalawat dan salam tercurah kepada Nabi kami Muhammad, keluarga, dan para sahabatnya. Segala puji bagi Allah, Rabb seluruh alam.",
    "notes": null,
    "fawaid": "Doa ini digunakan pada bulan Syaban sebagai perlindungan dari kesulitan, musibah, dan untuk memohon rezeki serta keberkahan dari Allah.",
    "source": "Doa Nifas Syaban"
  },
  {
    "title": "Doa Nurbuat",
    "arabic": "بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيْمِ اَللّٰهُمَّ ذِى السُّلْطَانِ الْعَظِيْمِ وَذِى الْمَنِّ الْقَدِيْمِ وَذِي الْوَجْهِ الْكَرِيْمِ وَوَلِيِّ الْكَلِمَاتِ التَّامَّاتِ وَالدَّعَوَاتِ الْمُسْتَجَابَةِ عَاقِلِ الْحَسَنِ وَالْحُسَيْنِ مِنْ اَنْفُسِ الْحَقِّ عَيْنِ الْقُدْرَةِ وَالنَّاظِرِيْنَ وَعَيْنِ الْجِنِّ الْاِنْسِ وَالشَّيَاطِيْنِ وَاِنْ يَّكَادُ الَّذِيْنَ كَفَرُوْا لَيُزْلِقُوْنَكَ بِاَبْصَارِهِمْ لَمَّا سَمِعُوا الذِّكْرَ وَيَقُوْلُوْنَ اِنَّهُ لَمَجْنُوْنٌ وَمَاهُوَ اِلاَّ الذِّكْرُ لِلْعَالَمِيْنَ وَمُسْتَجَابُ الْقُرْاٰنِ الْعَظِيْمِ وَوَرِثَ سُلَيْمَانُ دَاوُدَ عَلَيْهِمَا السَّلَامُ الْوَدُوْدُ ذُوالْعَرْشِ الْمَجِيْدِ طَوِّلْ عُمْرِيْ وَصَحِّحْ جَسَدِيْ وَاقْضِ حَاجَتِيْ وَاَكْثِرْ اَمْوَالِيْ وَاَوْلَادِيْ وَحَبِّبْنِيْ لِلنَّاسِ اَجْمَعِيْنَ وَتَبَاعَدِ الْعَدَاوَةَ كُلَّهَا مِنْ بَنِيْ اٰدَمَ عَلَيْهِ السَّلَامُ مَنْ كَانَ حَيًّا وَّيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِيْنَ اِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ وَسَلَامٌ عَلَى الْمُرْسَلِيْنَ وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ",
    "latin": "Bismillāhi ar-raḥmāni ar-raḥīm, Allāhumma dhī as-sulṭāni al-ʿaẓīm wa dhī al-manni al-qadīm wa dhī al-wajhi al-karīm wa waliyyi al-kalimāti at-tāmmāt wa ad-daʿawāti al-mustajābah, ʿĀqil al-Ḥasan wa al-Ḥusayn min anfus al-ḥaqq, ʿAyni al-qudrati wa an-nāẓirīn wa ʿAyni al-jinni al-ins wa ash-shayāṭīn, wa in yakādu alladhīna kafarū layuzliqunaka bi-abṣārihim lammā samiʿū adh-dhikr wa yaqūlūn innahu lamajnūn wa mā huwa illā adh-dhikr lil-ʿālamīn wa mustajābu al-qurʾāni al-ʿaẓīm, wa waritha Sulaymān Dāwūd ʿalayhimā as-salām al-wadūd dhū al-ʿarshi al-majīd, Ṭawwil ʿumrī wa ṣaḥḥiḥ jasadī wa aqḍi ḥājati wa akthir amwālī wa awlādī wa ḥabbibnī lin-nāsi ajmaʿīn wa tabāʿadi al-ʿadāwata kullahā min Banī Ādam ʿalayhi as-salām man kāna ḥayyan wa yaḥiqqu al-qawlu ʿalā al-kāfirīn, innaka ʿalā kulli shayʾin qadīr, subḥāna rabbika rabbil-ʿizzati ʿammā yaṣifūn, wa salāmun ʿalā al-mursalīn, wal-ḥamdu lillāhi rabbil-ʿālamīn",
    "translation": "Ya Allah, wahai Pemilik kekuasaan yang agung, Dzat yang Maha Pemberi, Yang mulia, Pelindung semua kata yang sempurna dan doa yang dikabulkan. Engkau yang menata kebaikan Hasan dan Husain dari inti kebenaran, pengawas jin, manusia, dan setan. Sesungguhnya orang-orang kafir hampir menyesatkan-Mu dengan pandangan mereka ketika mendengar Al-Qur'an dan berkata itu gila. Tetapi ini adalah dzikir untuk seluruh alam, Al-Qur'an yang agung, diwarisi Sulaiman dan Dawud, damai atas mereka, Yang Maha Mengasihi dan pemilik Arsy yang mulia. Panjangkan umurku, sehatkan tubuhku, penuhi hajatku, perbanyak harta dan anakku, cintakan aku kepada semua manusia, jauhkan permusuhan dari Bani Adam. Sungguh, Engkau Maha Kuasa atas segala sesuatu. Maha Suci Rabb-mu, Rabb Kemuliaan, dari apa yang mereka sifatkan. Damai atas para Rasul, dan segala puji bagi Allah, Rabb seluruh alam.",
    "notes": null,
    "fawaid": "Doa ini digunakan untuk perlindungan, keberkahan rezeki, kesehatan, panjang umur, dan menjalin kasih sayang antar manusia.",
    "source": "Doa Nurbuat"
  },
  {
    "title": "Doa Selamat",
    "arabic": "اللّهُمَّ إِنَّا نَسْئَلُكَ سَلاَمَةً فِي الدِّيْنِ وَعَافِيَةً فِي الْجَسَدِ وَزِيَادَةً فِي الْعِلْمِ وَبَرَكَةً فِي الرِّزْقِ وَتَوْبَةً قَبْلَ الْمَوْتِ وَرَحْمَةً عِنْدَ الْمَوْتِ وَمَغْفِرَةً بَعْدَ الْمَوْتِ، اللّهُمَّ هَوِّنْ عَلَيْنَا فِي سَكَرَاتِ الْمَوْتِ وَالنَّجَاةَ مِنَ النَّارِ وَالْعَفْوَ عِنْدَ الْحِسَابِ، رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ، رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "latin": "Allāhumma innā nasʾaluka salāmata fī ad-dīn wa ʿāfiyata fī al-jasad wa ziyādatan fī al-ʿilm wa barakatan fī ar-rizq wa tawbatan qabla al-mawt wa raḥmatan ʿinda al-mawt wa maghfiratan baʿda al-mawt, Allāhumma hawwin ʿalaynā fī sakarāti al-mawt wa an-najāta mina an-nār wa al-ʿafwa ʿinda al-ḥisāb, Rabbana lā tuzigh qulūbanā baʿda idh hadaytana wa hab lanā min ladunka raḥmatan innaka anta al-wahhāb, Rabbana ātinā fī ad-dunyā ḥasanatan wa fī al-ākhirah ḥasanatan wa qinā ʿadhāba an-nār",
    "translation": "Ya Allah, kami memohon keselamatan dalam agama, kesehatan jasmani, penambahan ilmu, berkah dalam rezeki, tobat sebelum mati, rahmat saat mati, dan ampunan setelah mati. Ya Allah, permudah kami dalam sakaratul maut, selamat dari api neraka, dan ampunan pada saat perhitungan. Ya Rabb, janganlah Engkau sesatkan hati kami setelah Engkau memberi petunjuk, dan anugerahkanlah rahmat dari sisi-Mu, sesungguhnya Engkau Maha Pemberi. Ya Rabb, berikanlah kami kebaikan di dunia dan di akhirat, dan lindungilah kami dari siksa neraka.",
    "notes": null,
    "fawaid": "Doa ini memohon keselamatan lahir dan batin, kebaikan dunia dan akhirat, serta perlindungan dari siksa dan bahaya kematian.",
    "source": "HR. al-Bukhari, Muslim"
  },
  {
    "title": "Doa Yasin",
    "arabic": "اللّٰهُمَّ اِنّٓا نَسْتَحْفِظُكَ وَ نَسْتَوْدِعُكَ اَدْيَانَنَا وَاَنْفُسَنَا وَاَهْلَنَا وَاَوْلَادَنَا وَاَمْوَالَنَا وَكُلِّ شَيْءٍ اَعْطَيْتَنَا، اللّٰهُمَّ اجْعَلْنَا وَإِيَّاهُمْ فِي كَنَفِكَ وَاَمَانِكَ وَجِوَارِكَ وَعِيَاذِكَ مِن كُلِّ شَيْطَانٍ مَرِيدٍ وَجَبَّارٍ عَنِيدٍ وَذِى عَيْنٍ وَذِى بَغْيٍ وَمِنْ شَرِّ كُلِّ ذِى شَرٍّ اِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللّٰهُمَّ جَمِّلْنَا بِالْعَافِيَةِ وَالسَّلَامَةِ وَحَقِّقنَا بِالتَّقْوٰى وَالْاِسْتِقَامَةِ وَاَعِذْنَا مِنْ مُوجِبَاتِ النَّدَامَةِ اِنَّكَ سَمِيْعُ الدُّعَاءِ، اللّٰهُمَّ اغْفِرْلَنَا وَلِوَالِدِيْنَا وَلِاَوْلَادِنَا وَمَشَايِخِنَا وَلِاِخْوَانِنَا فِي الدِّينِ وَلِاَصْحَابِنَا وَاَحْبَابِنَا وَلِمَنْ اَحَبَّنَا فِيكَ وَلِمَنْ اَحْسَنَ اِلَيْنَا وَ لِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْمُسْلِمِينَ وَالْمُسْلِمَاتِ يَارَبَّ العَالَمِيْنَ، وَصَلِّ اَللّٰهُمَّ عَلَى عَبْدِكَ وَرَسُولِكَ سَيِّدِنَا وَمَوْلاَناَ مُحَمَّدٍ وَعَلَى اٰلِهِ وَصَحْبِهِ وَسَلِّمْ، وَارْزُقْنَا كَمَالَ الْمُتَابَعَةِ لَهُ وَظَاهِرًا وَبَاطِنًا فِي عَافِيَةٍ وَسَلَامَةٍ بِرَحْمَتِكَ يَا اَرْحَمَ الرَّاحِمِينَ",
    "latin": "Allāhumma innā nastahfiẓuka wa nastawdiʿuka adyānana wa anfusana wa ahlana wa awlādanā wa amwālanā wa kulli shay'in aʿṭaytanā, Allāhumma ajʿalnā wa iyyāhum fī kanafika wa amānika wa jiwārika wa ʿiādhika min kulli shayṭān marīd wa jabbār ʿanīd wa dhī ʿayn wa dhī baghy wa min sharri kulli dhī shar, innaka ʿalā kulli shay'in qadīr, Allāhumma jammilnā bil-ʿāfiyati wa as-salāmah wa ḥaqqiqnā bit-taqwā wal-istiqāmah wa aʿiẓnā min mujibāti an-nadāmah innaka samīʿu ad-duʿā', Allāhumma ighfir lanā wa li-wālidīnā wa li-awlādinā wa mashāyikhinā wa li-ikhwāninā fī ad-dīn wa li-aṣḥābinā wa aḥbābinā wa liman aḥabbana fīka wa liman aḥsana ilaynā wa lil-muʾminīna wal-muʾmināt wal-muslimīna wal-muslimāt yā Rabbal-ʿālamīn, wa ṣalli Allāhumma ʿalā ʿabdika wa rasūlika sayyidinā wa mawlānā Muḥammad wa ʿalā ālihi wa ṣaḥbihi wa sallim, warzuqnā kamāl al-mutābaʿah lahu wa ẓāhiran wa bāṭinan fī ʿāfiyatin wa salāmah bi-raḥmatika yā arḥamal-rāḥimīn",
    "translation": "Ya Allah, kami memohon perlindungan-Mu atas agama, diri, keluarga, anak-anak, harta, dan segala yang Engkau berikan. Jadikanlah kami dan mereka dalam naungan, keselamatan, perlindungan, dan lindungan-Mu dari segala setan dan kejahatan. Perindahlah kami dengan kesehatan, keselamatan, ketakwaan, istiqamah, dan jauhkan dari penyesalan. Ampunilah kami, orang tua, anak-anak, guru, saudara seiman, teman, orang yang kami sayangi, dan seluruh kaum mukminin. Limpahkan kami mengikuti teladan Nabi Muhammad ﷺ lahir dan batin dengan keselamatan dan rahmat-Mu. Ya Arhamar-Rahimin.",
    "notes": null,
    "fawaid": "Doa ini memohon perlindungan, kesehatan, keselamatan, dan keberkahan hidup serta mengikuti teladan Nabi ﷺ.",
    "source": "Yasin"
  },
  {
    "title": "Doa Ketika Terlilit Hutang",
    "arabic": "اللَّهُمَّ اكْفِنِى بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِنِى بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "latin": "Allahumak finī bi halālika 'an haroomik, wa agh niniy bi fadhlika 'amman siwāk",
    "translation": "Ya Allah cukupkanlah aku dengan yang halal dan jauhkanlah aku dari yang haram, dan cukupkanlah aku dengan karunia-Mu dari bergantung pada selain-Mu.",
    "notes": null,
    "fawaid": "Rezeki halal walaupun sedikit lebih baik dari harta haram yang jumlahnya melimpah.",
    "source": "HR. at-Tirmidzi No. 2563"
  },
  {
    "title": "Doa Memohon Perlindungan Dari Sifat Malas, Kesedihan, dan Lilitan Hutang",
    "arabic": "اَللّٰهُمَّ إِنِّى أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحَزْنِ وَأَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَأَعُوْذُبِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوْذُبِكَ مِنْ غَلَبَتِ الدَّيْنِ وَقَهْرِ الرجال",
    "latin": "Allahumma innī a'ūżu bika minal hammi wal hazan. Wa a'użu bika minal 'ajzi wal kasal. Wa a'ūżu bika minal jubni wal bukhl. Wa a'ūżu bika min ghalabatiddayni wa qahrirrijāl",
    "translation": "Ya Allah, aku berlindung kepada-Mu dari kebingungan dan kesedihan, aku berlindung kepada-Mu dari kelemahan dan kemalasan, aku berlindung kepada-Mu dari ketakutan dan kekikiran, aku berlindung kepada-Mu dari lilitan hutang dan tekanan orang-orang.",
    "notes": null,
    "fawaid": "Abu Umamah lalu menuturkan: Setelah aku mengamalkan doa itu, Allah benar-benar menghilangkan kebingunganku dan memberi kemampuan melunasi hutang.",
    "source": "HR. Abu Dawud No. 1555"
  },
  {
    "title": "Doa Meminta Akhlak yang Baik",
    "arabic": "اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "latin": "Allahumma kamā hassanta kholqī fahassin khuluqī",
    "translation": "Ya Allah, sebagaimana Engkau memperbagus badanku maka perbaguslah akhlaku.",
    "notes": null,
    "fawaid": "Paras yang menawan tidaklah cukup sebagai bekal seorang muslim, tapi harus diiringi dengan akhlak yang mulia. Maka hendaklah seorang muslim terus meminta untuk diperbaiki dan diperindah akhlaknya.",
    "source": "HR. Ahmad, dishahihkan al-Albani dalam al-Irwa', 1/115"
  }
]